import 'package:brew_buds/search/models/search_result_model.dart';
import 'package:brew_buds/search/models/search_subject.dart';
import 'package:flutter/foundation.dart';

final class SearchPresenter extends ChangeNotifier {
  final List<SearchSubject> _subjects = [
    SearchSubject.coffeeBean,
    SearchSubject.buddy,
    SearchSubject.tastedRecord,
    SearchSubject.post,
  ];
  int _tabIndex = 0;

  List<SearchSubject> get tabs => _subjects;

  int get currentTabIndex => _tabIndex;

  SearchSubject get currentTab => _subjects[_tabIndex];

  List<SearchResultModel> get searchResult => [coffeeBeanDummy, buddyDummy, tastedRecordDummy, postDummy][_tabIndex];

  bool _disposed = false;

  @override
  void dispose() {
    _disposed = true;
    super.dispose();
  }

  @override
  notifyListeners() {
    if (!_disposed) {
      super.notifyListeners();
    }
  }

  onChangeTab(int index) {
    _tabIndex = index;
  }
}

final coffeeBeanDummy = [
  ('에티오피아 시다모 G2 워시드', 4.8, 220),
  ('에티오피아 구지 시다모 G1', 4.8, 220),
  ('에티오피아 예가체프 G4', 4.8, 220),
  ('에티오피아 아리차 예가체프 G1 내추럴', 4.8, 220),
  ('에티오피아 시다모 G2 워시드', 4.8, 220),
  ('에티오피아 구지 시다모 G1', 4.8, 220),
  ('에티오피아 예가체프 G4', 4.8, 220),
  ('에티오피아 아리차 예가체프 G1 내추럴', 4.8, 220),
  ('에티오피아 시다모 G2 워시드', 4.8, 220),
  ('에티오피아 구지 시다모 G1', 4.8, 220),
  ('에티오피아 예가체프 G4', 4.8, 220),
  ('에티오피아 아리차 예가체프 G1 내추럴', 4.8, 220),
  ('에티오피아 시다모 G2 워시드', 4.8, 220),
  ('에티오피아 구지 시다모 G1', 4.8, 220),
  ('에티오피아 예가체프 G4', 4.8, 220),
  ('에티오피아 아리차 예가체프 G1 내추럴', 4.8, 220),
  ('에티오피아 시다모 G2 워시드', 4.8, 220),
  ('에티오피아 구지 시다모 G1', 4.8, 220),
  ('에티오피아 예가체프 G4', 4.8, 220),
  ('에티오피아 아리차 예가체프 G1 내추럴', 4.8, 220),
  ('에티오피아 시다모 G2 워시드', 4.8, 220),
  ('에티오피아 구지 시다모 G1', 4.8, 220),
  ('에티오피아 예가체프 G4', 4.8, 220),
  ('에티오피아 아리차 예가체프 G1 내추럴', 4.8, 220),
].map((e) => SearchResultModel.coffeeBean(id: 0, name: e.$1, rating: e.$2, recordedCount: e.$3)).toList();

final buddyDummy = [
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
  ('', '에티오피아에서커피한잔', 1293, 283),
].map((e) => SearchResultModel.buddy(id: 0, profileImageUri: e.$1, nickname: e.$2, followerCount: e.$3, tastedRecordsCount: e.$4)).toList();

final tastedRecordDummy = [
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
  (
    '',
    '에티오피아 할로 하르투메 G1 워시드',
    4.5,
    '싱글 오리진',
    ['트로피칼', '트로피칼', '트로피칼', '트로피칼'],
    '산미를 좋아하시면 에티오피아 괜찮아요^^',
  ),
].map((e) => SearchResultModel.tastedRecord(id: 0, title: e.$1, rating: e.$3, beanType: e.$4, taste: e.$5, contents: e.$6, imageUri: e.$2)).toList();

final postDummy = [
  (
    '에티오피아 원두 어때요?',
    '가나다라마바사아자차카타파하가나다라마바사아자차카타파하가나다라마바사아자차카타파하가나다라마바사아자차카타파하가나다라마바사아자차카타파하에티오피아 원두 추천드립니다.가나다라마바사아자차카타파하가나다라마바사아자차카타파하가나다라마바사아자차카타파하',
    923,
    30,
    '정보',
    '3시간 전',
    5,
    '커피의 신',
  ),
  (
    '에티오피아 케냐 나이지리아 원두 추천',
    '가나다라마바사아자차카타파하가나다라마바사아자차카타파하가나다라마바사아자차카타파하가나다라마바사아자차카타파하가나다라마바사아자차카타파하',
    12,
    2,
    '질문',
    '6주 전',
    10457,
    '일어나자마자커피한잔',
  ),
  (
    '나이지리아 원두 추천',
    '가나다라마바사아자차카타파하가나다라마바사아자차카타파하에티오피아가나다라마바사아자차카타파하가나다라마바사아자차카타파하가나다라마바사아자차카타파하',
    12,
    2,
    '질문',
    '6주 전',
    48,
    '일어나자마자커피한잔',
  ),
].map((e) => SearchResultModel.post(id: 0, title: e.$1, contents: e.$2, likeCount: e.$3, commentCount: e.$4, hits: e.$7, createdAt: e.$6, authorNickname: e.$8, subject: e.$5, imageUri: '')).toList();
